; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 703805 1 3 2 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation1 - direction
	Star2 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Planet10 image0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 0 of 3
3. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 3
4. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 3
5. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 3
6. (take_image satellite0 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 1 of 3
7. (turn_to satellite0 planet8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet8)
   goals met: 1 of 3
8. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 3
9. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   goals met: 2 of 3
10. (take_image satellite0 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 3
